
<!DOCTYPE HTML>
<html lang="en" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第六章 如何使用Burp Spider · burpsuite实战指南</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="t0data">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-comment/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="styles/website.css">
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chapter7.html" />
    
    
    <link rel="prev" href="chapter5.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://www.gitbook.com/book/t0data/burpsuite" target="_blank" class="custom-link">burpsuite实战指南</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="index.html">
            
                    
                    引子
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="chapter1.html">
            
                <a href="chapter1.html">
            
                    
                    第一章 Burp Suite 安装和环境配置
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="chapter2.html">
            
                <a href="chapter2.html">
            
                    
                    第二章 Burp Suite代理和浏览器设置
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="chapter3.html">
            
                <a href="chapter3.html">
            
                    
                    第三章 如何使用Burp Suite代理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="chapter4.html">
            
                <a href="chapter4.html">
            
                    
                    第四章  SSL和Proxy高级选项
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="chapter5.html">
            
                <a href="chapter5.html">
            
                    
                    第五章 如何使用Burp Target
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.7" data-path="chapter6.html">
            
                <a href="chapter6.html">
            
                    
                    第六章 如何使用Burp Spider
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="chapter7.html">
            
                <a href="chapter7.html">
            
                    
                    第七章   如何使用Burp Scanner
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="chapter8.html">
            
                <a href="chapter8.html">
            
                    
                    第八章   如何使用Burp Intruder
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="chapter9.html">
            
                <a href="chapter9.html">
            
                    
                    第九章   如何使用Burp Repeater
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="chapter10.html">
            
                <a href="chapter10.html">
            
                    
                    第十章   如何使用Burp Sequencer
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="chapter11.html">
            
                <a href="chapter11.html">
            
                    
                    第十一章   如何使用Burp Decoder
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="chapter12.html">
            
                <a href="chapter12.html">
            
                    
                    第十二章   如何使用Burp Comparer
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="chapter13.html">
            
                <a href="chapter13.html">
            
                    
                    第十三章 数据查找和拓展功能的使用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="chater14.html">
            
                <a href="chater14.html">
            
                    
                    第十四章 BurpSuite全局参数设置和使用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="chapter15.html">
            
                <a href="chapter15.html">
            
                    
                    第十五章 BurpSuite应用商店插件的使用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="chapter16.html">
            
                <a href="chapter16.html">
            
                    
                    第十六章 如何编写自己的BurpSuite插件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="chapter17.html">
            
                <a href="chapter17.html">
            
                    
                    第十七章 使用Burp Suite测试Web Services服务
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="chapter18.html">
            
                <a href="chapter18.html">
            
                    
                    第十八章 使用Burp, Sqlmap进行自动化SQL注入渗透测试
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="chapter19.html">
            
                <a href="chapter19.html">
            
                    
                    第十九章 使用Burp、PhantomJS进行XSS检测
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="chapter20.html">
            
                <a href="chapter20.html">
            
                    
                    第二十章  使用Burp 、Android Killer进行安卓app渗透测试
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="index.html" >第六章 如何使用Burp Spider</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h3 id="&#x7B2C;&#x516D;&#x7AE0;-&#x5982;&#x4F55;&#x4F7F;&#x7528;burp-spider"><a id="6F" name="6F">&#x7B2C;&#x516D;&#x7AE0; &#x5982;&#x4F55;&#x4F7F;&#x7528;Burp Spider</a></h3>
<p>&#x901A;&#x8FC7;&#x524D;&#x4E00;&#x7AE0;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x6211;&#x4EEC;&#x4E86;&#x89E3;&#x5230;&#xFF0C;&#x5B58;&#x5728;&#x4E8E;Burp Target&#x4E2D;&#x7684;&#x7AD9;&#x70B9;&#x4FE1;&#x606F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4F20;&#x9001;&#x5230;Burp Spider&#x4E2D;&#x8FDB;&#x884C;&#x7AD9;&#x70B9;&#x4FE1;&#x606F;&#x7684;&#x722C;&#x53D6;&#x3002;&#x8FD9;&#x4E00;&#x7AE0;&#x6211;&#x4EEC;&#x91CD;&#x70B9;&#x6765;&#x5B66;&#x4E60;Burp Spider&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x4E3B;&#x8981;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x65B9;&#x9762;&#xFF1A;</p>
<ul>
<li>Spider&#x63A7;&#x5236;&#xFF08;Control&#xFF09;</li>
<li>Spider&#x53EF;&#x9009;&#x9879;&#x8BBE;&#x7F6E;&#xFF08;Options&#xFF09;</li>
</ul>
<p>Burp Spider&#x7684;&#x529F;&#x80FD;&#x4E3B;&#x8981;&#x4F7F;&#x7528;&#x4E8E;&#x5927;&#x578B;&#x7684;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x6D4B;&#x8BD5;&#xFF0C;&#x5B83;&#x80FD;&#x5728;&#x5F88;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x5FEB;&#x901F;&#x5730;&#x4E86;&#x89E3;&#x7CFB;&#x7EDF;&#x7684;&#x7ED3;&#x6784;&#x548C;&#x5206;&#x5E03;&#x60C5;&#x51B5;&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5C31;&#x5148;&#x6765;&#x770B;&#x770B;Spider&#x63A7;&#x5236;&#xFF0C;</p>
<h3 id="spider&#x63A7;&#x5236;">Spider&#x63A7;&#x5236;</h3>
<hr>
<p>Spider&#x63A7;&#x5236;&#x754C;&#x9762;&#x7531;Spider &#x72B6;&#x6001;&#x548C;Spider &#x4F5C;&#x7528;&#x57DF;&#x4E24;&#x4E2A;&#x529F;&#x80FD;&#x7EC4;&#x6210;&#x3002;
<img src="images/6_01.png" alt="">
Spider &#x72B6;&#x6001;&#x9664;&#x4E86;&#x663E;&#x793A;&#x5F53;&#x524D;&#x8FDB;&#x5EA6;&#x3001;&#x4F20;&#x8F93;&#x60C5;&#x51B5;&#x3001;&#x8BF7;&#x6C42;&#x961F;&#x5217;&#x7B49;&#x7EDF;&#x8BA1;&#x4FE1;&#x606F;&#x5916;&#xFF0C;&#x8FD8;&#x6709;Spider&#x8FD0;&#x884C;/&#x6682;&#x505C;&#x6309;&#x94AE;&#x4E0E;&#x6E05;&#x7A7A;&#x961F;&#x5217;&#x6309;&#x94AE;&#xFF0C;&#x5206;&#x522B;&#x7528;&#x6765;&#x63A7;&#x5236;Spider&#x662F;&#x5426;&#x8FD0;&#x884C;&#x548C;&#x961F;&#x5217;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x7BA1;&#x7406;&#x3002;&#x800C;Spider &#x4F5C;&#x7528;&#x57DF;&#x662F;&#x7528;&#x6765;&#x63A7;&#x5236;Spider&#x7684;&#x6293;&#x53D6;&#x8303;&#x56F4;&#xFF0C;&#x4ECE;&#x56FE;&#x4E2D;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6709;&#x4E24;&#x79CD;&#x63A7;&#x5236;&#x65B9;&#x5F0F;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x4F7F;&#x7528;&#x4E0A;&#x4E00;&#x7AE0;&#x8BB2;&#x7684;Target Scope&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x662F;&#x7528;&#x6237;&#x81EA;&#x5B9A;&#x4E49;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x9009;&#x4E2D;&#x7528;&#x6237;&#x81EA;&#x5B9A;&#x4E49;&#x6309;&#x94AE;&#xFF0C;&#x754C;&#x9762;&#x6539;&#x53D8;&#x6210;&#x4E0B;&#x9762;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;
<img src="images/6_02.png" alt="">
&#x6B64;&#x5904;&#x7528;&#x6237;&#x81EA;&#x5B9A;&#x4E49;&#x4F5C;&#x7528;&#x57DF;&#x7684;&#x914D;&#x7F6E;&#x4E0E;Target Scope &#x7684;&#x914D;&#x7F6E;&#x5B8C;&#x5168;&#x4E00;&#x81F4;&#xFF0C;&#x5177;&#x4F53;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#x8BF7;&#x53C2;&#x6570;&#x4E0A;&#x4E00;&#x7AE0;Target Scope &#x7684;&#x914D;&#x7F6E;&#x3002;</p>
<h4 id="spider&#x53EF;&#x9009;&#x9879;&#x8BBE;&#x7F6E;">Spider&#x53EF;&#x9009;&#x9879;&#x8BBE;&#x7F6E;</h4>
<p>Spider&#x53EF;&#x9009;&#x9879;&#x8BBE;&#x7F6E;&#x7531;&#x6293;&#x53D6;&#x8BBE;&#x7F6E;&#x3001;&#x6293;&#x53D6;&#x4EE3;&#x7406;&#x8BBE;&#x7F6E;&#x3001;&#x8868;&#x5355;&#x63D0;&#x4EA4;&#x8BBE;&#x7F6E;&#x3001;&#x5E94;&#x7528;&#x767B;&#x9646;&#x8BBE;&#x7F6E;&#x3001;&#x8718;&#x86DB;&#x5F15;&#x64CE;&#x8BBE;&#x7F6E;&#x3001;&#x8BF7;&#x6C42;&#x6D88;&#x606F;&#x5934;&#x8BBE;&#x7F6E;&#x516D;&#x4E2A;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#x3002;</p>
<ul>
<li>&#x6293;&#x53D6;&#x8BBE;&#x7F6E;&#xFF08;Crawls Settings&#xFF09;
-&#x6B64;&#x9879;&#x662F;&#x7528;&#x6765;&#x63A7;&#x5236;&#x8718;&#x86DB;&#x6293;&#x53D6;&#x7F51;&#x9875;&#x5185;&#x5BB9;&#x7684;&#x65B9;&#x5F0F;
<img src="images/6_03.png" alt="">
&#x81EA;&#x4E0A;&#x800C;&#x4E0B;&#x4F9D;&#x6B21;&#x662F;&#xFF1A;&#x68C0;&#x67E5;robots.txt &#x6587;&#x4EF6;&#x3001;&#x68C0;&#x6D4B;404&#x5E94;&#x7B54;&#x3001;&#x5FFD;&#x7565;&#x5185;&#x5BB9;&#x4E3A;&#x7A7A;&#x7684;&#x94FE;&#x63A5;&#x3001;&#x722C;&#x53D6;&#x6839;&#x76EE;&#x5F55;&#x4E0B;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x548C;&#x76EE;&#x5F55;&#x3001;&#x5BF9;&#x6BCF;&#x4E00;&#x4E2A;&#x52A8;&#x6001;&#x9875;&#x9762;&#x53D1;&#x9001;&#x65E0;&#x53C2;&#x6570;&#x8BF7;&#x6C42;&#x3001;&#x6700;&#x5927;&#x94FE;&#x63A5;&#x6DF1;&#x5EA6;&#x3001;&#x6700;&#x5927;&#x8BF7;&#x6C42;URL&#x53C2;&#x6570;&#x6570;&#x76EE;</li>
<li>&#x6293;&#x53D6;&#x4EE3;&#x7406;&#x8BBE;&#x7F6E;&#xFF08;Passive Spidering &#xFF09;
<img src="images/6_04.png" alt="">
&#x8FD9;&#x4E2A;&#x8BBE;&#x7F6E;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x5982;&#x679C;&#x52FE;&#x9009;&#xFF0C;&#x5219;&#x722C;&#x53D6;&#x65F6;&#x901A;&#x8FC7;Burp Proxy&#xFF0C;&#x53CD;&#x4E4B;&#x5219;&#x4E0D;&#x901A;&#x8FC7;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x8BBE;&#x7F6E;&#x662F;&#x63A7;&#x5236;&#x4EE3;&#x7406;&#x7684;&#x94FE;&#x63A5;&#x6DF1;&#x5EA6;&#x3002;&#x9ED8;&#x8BA4;&#x4E3A;0&#xFF0C;&#x8868;&#x793A;&#x65E0;&#x9650;&#x6DF1;&#x5EA6;&#xFF0C;&#x5373;&#x65E0;&#x8BBA;&#x6709;&#x591A;&#x5C11;&#x5C42;&#x7EA7;&#x7684;URL&#x5747;&#x9700;&#x8981;&#x722C;&#x53D6;&#x3002;</li>
<li>&#x8868;&#x5355;&#x63D0;&#x4EA4;&#x8BBE;&#x7F6E;&#xFF08;Form Submission&#xFF09;
&#x8868;&#x5355;&#x63D0;&#x4EA4;&#x8BBE;&#x7F6E;&#x4E3B;&#x8981;&#x662F;&#x7528;&#x6765;&#x63A7;&#x5236;&#x5728;&#x8718;&#x86DB;&#x6293;&#x53D6;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5BF9;&#x4E8E;form&#x8868;&#x5355;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#xFF0C;&#x5176;&#x754C;&#x9762;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;
<img src="images/6_05.png" alt="">
&#x7B2C;&#x4E00;&#x4E2A;&#x4E0B;&#x62C9;&#x9009;&#x9879;&#x4E2D;&#xFF0C;&#x662F;&#x5BF9;form&#x8868;&#x5355;&#x57DF;&#x7684;&#x5904;&#x7406;&#x5185;&#x5BB9;&#x505A;&#x63A7;&#x5236;&#xFF0C;&#x9ED8;&#x8BA4;&#x9009;&#x62E9;Action URL&#x3001;method&#x3001;fields&#x3001;values&#xFF0C;&#x5373;&#x540C;&#x65F6;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#x7684;url&#x3001;&#x8BF7;&#x6C42;&#x65B9;&#x5F0F;GET&#x6216;&#x8005;POST&#x3001;&#x5305;&#x542B;&#x54EA;&#x4E9B;&#x5C5E;&#x6027;&#x540D;&#x4EE5;&#x53CA;&#x5C5E;&#x6027;&#x503C;&#x3002;&#x70B9;&#x51FB;&#x4E0B;&#x62C9;&#x9009;&#x9879;&#xFF0C;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x6216;&#x8005;&#x51E0;&#x4E2A;&#x3002;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;
<img src="images/6_06.png" alt="">
&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x8BBE;&#x7F6E;&#x7684;&#x63A7;&#x5236;form&#x8868;&#x5355;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#xFF1A;&#x4E0D;&#x63D0;&#x4EA4;&#x8868;&#x5355;&#x3001;&#x9700;&#x8981;&#x624B;&#x5DE5;&#x786E;&#x8BA4;&#x3001;&#x4F7F;&#x7528;&#x9ED8;&#x8BA4;&#x503C;&#x81EA;&#x52A8;&#x586B;&#x5199;&#x4E09;&#x79CD;&#x65B9;&#x5F0F;&#x3002;
&#x4E0D;&#x63D0;&#x4EA4;&#x8868;&#x5355;&#x7684;&#x542B;&#x4E49;&#x662F;&#x6293;&#x53D6;&#x65F6;&#x5019;&#x4E0D;&#x63D0;&#x4EA4;&#x8868;&#x5355;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x4E2A;&#x975E;&#x5E38;&#x597D;&#x7406;&#x89E3;&#xFF1B;&#x9700;&#x8981;&#x624B;&#x5DE5;&#x786E;&#x8BA4;&#x662F;&#x6307;&#x5F53;&#x6293;&#x53D6;&#x8868;&#x5355;&#x65F6;&#xFF0C;&#x5F39;&#x51FA;&#x754C;&#x9762;&#xFF0C;&#x8BA9;&#x6E17;&#x900F;&#x6D4B;&#x8BD5;&#x4EBA;&#x5458;&#x81EA;&#x5DF1;&#x624B;&#x5DE5;&#x786E;&#x8BA4;&#x8868;&#x5355;&#x6570;&#x636E;&#xFF1B;&#x4F7F;&#x7528;&#x9ED8;&#x8BA4;&#x503C;&#x81EA;&#x52A8;&#x586B;&#x5199;&#x662F;&#x5BF9;&#x8868;&#x5355;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4F7F;&#x7528;&#x4E0B;&#x65B9;&#x7684;&#x5404;&#x4E2A;&#x914D;&#x7F6E;&#x9879;&#x8FDB;&#x884C;&#x5339;&#x914D;&#xFF08;&#x5339;&#x914D;&#x65F6;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B8C;&#x5168;&#x5339;&#x914D;&#x548C;&#x6B63;&#x5219;&#x8868;&#x8FBE;&#x5F0F;&#x5339;&#x914D;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x5176;&#x4E00;&#xFF09;&#xFF0C;&#x9ED8;&#x8BA4;&#x586B;&#x5199;&#x8FD9;&#x4E9B;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x81EA;&#x52A8;&#x8FDB;&#x884C;&#x63D0;&#x4EA4;&#x3002;&#x5176;&#x754C;&#x9762;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;
<img src="images/6_07.png" alt="">
&#x4ECE;&#x4E0A;&#x56FE;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x5BF9;&#x4E8E;&#x8868;&#x5355;&#x7684;&#x8F93;&#x5165;&#x57DF;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;&#x548C;&#x4FEE;&#x6539;&#x4EE5;&#x6EE1;&#x8DB3;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x7684;&#x9700;&#x8981;&#xFF0C;&#x5982;&#x679C;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x7684;&#x5C5E;&#x6027;&#x8F93;&#x5165;&#x57DF;&#x6211;&#x4EEC;&#x4E0D;&#x60F3;&#x6BCF;&#x4E00;&#x4E2A;&#x90FD;&#x5F55;&#x5165;&#xFF0C;&#x53EF;&#x4EE5;&#x52FE;&#x9009;&#x201C;&#x8BBE;&#x7F6E;&#x4E0D;&#x5339;&#x914D;&#x7684;&#x5C5E;&#x6027;&#x503C;&#x201D;&#xFF0C;&#x7EDF;&#x4E00;&#x6307;&#x5B9A;&#x8F93;&#x5165;&#x7684;&#x503C;&#x3002;&#x5982;&#x56FE;&#x4E2D;&#x7684;555-555-0199@example.com</li>
<li>&#x5E94;&#x7528;&#x767B;&#x9646;&#xFF08;Application Login&#xFF09;
&#x6B64;&#x9009;&#x62E9;&#x9879;&#x4E3B;&#x8981;&#x7528;&#x6765;&#x63A7;&#x5236;&#x6293;&#x53D6;&#x65F6;&#xFF0C;&#x767B;&#x9646;&#x9875;&#x9762;&#x7684;&#x5904;&#x7406;&#x65B9;&#x5F0F;&#x3002;
<img src="images/6_08.png" alt="">
&#x9009;&#x62E9;&#x9879;&#x4F9D;&#x6B21;&#x662F;&#xFF1A;&#x4E0D;&#x63D0;&#x4EA4;&#x767B;&#x9646;&#x4FE1;&#x606F;&#x3001;&#x624B;&#x5DE5;&#x786E;&#x8BA4;&#x767B;&#x9646;&#x4FE1;&#x606F;&#x3001;&#x4F5C;&#x4E3A;&#x666E;&#x901A;&#x8868;&#x5355;&#x5904;&#x7406;&#xFF08;&#x5982;&#x679C;&#x9009;&#x62E9;&#x6B64;&#x9879;&#xFF0C;&#x5219;&#x628A;&#x767B;&#x9646;&#x8868;&#x5355;&#x7684;form&#x5F53;&#x4F5C;&#x5176;&#x4ED6;&#x8868;&#x5355;&#x4E00;&#x6837;&#x5904;&#x7406;&#xFF0C;&#x5BF9;&#x4E8E;&#x767B;&#x9646;&#x8868;&#x5355;&#x5C06;&#x4F7F;&#x7528;&quot;&#x8868;&#x5355;&#x63D0;&#x4EA4;&#x8BBE;&#x7F6E;&quot; &#x4E2D;&#x7684;&#x5177;&#x4F53;&#x914D;&#x7F6E;&#xFF09;&#x3001;&#x81EA;&#x52A8;&#x63D0;&#x4EA4;&#x767B;&#x9646;&#xFF08;&#x9009;&#x62E9;&#x6B64;&#x9879;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x4E0B;&#x65B9;&#x7684;&#x8F93;&#x5165;&#x6846;&#x4E2D;&#x6307;&#x5B9A;&#x7528;&#x6237;&#x540D;&#x548C;&#x5BC6;&#x7801;&#xFF09;</li>
<li>&#x8718;&#x86DB;&#x5F15;&#x64CE;&#x8BBE;&#x7F6E;&#xFF08;Spider  Engine)&#x548C;HTTP &#x6D88;&#x606F;&#x5934;&#x8BBE;&#x7F6E;&#xFF08;Requests Header&#xFF09;
<img src="images/6_09.png" alt="">
&#x5176;&#x4E2D;&#x8718;&#x86DB;&#x5F15;&#x64CE;&#x8BBE;&#x7F6E;&#x4E3B;&#x8981;&#x662F;&#x7528;&#x6765;&#x63A7;&#x5236;&#x8718;&#x86DB;&#x6293;&#x53D6;&#x7684;&#x7EBF;&#x7A0B;&#x6570;&#x3001;&#x7F51;&#x7EDC;&#x5931;&#x8D25;&#x65F6;&#x91CD;&#x8BD5;&#x7684;&#x6B21;&#x6570;&#x3001;&#x91CD;&#x8BD5;&#x6682;&#x505C;&#x95F4;&#x9699;&#x7B49;&#xFF0C;&#x800C;HTTP &#x6D88;&#x606F;&#x5934;&#x8BBE;&#x7F6E;&#x662F;&#x7528;&#x6765;&#x8BBE;&#x7F6E;Http&#x8BF7;&#x6C42;&#x7684;&#x6D88;&#x606F;&#x5934;&#x81EA;&#x5B9A;&#x4E49;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7F16;&#x8F91;&#x6D88;&#x606F;&#x5934;&#x4FE1;&#x606F;&#xFF0C;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x8BF7;&#x6C42;&#x4E3A;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#xFF0C;&#x6216;&#x8005;&#x4E0D;&#x540C;&#x7684;&#x624B;&#x673A;&#x578B;&#x53F7;&#xFF0C;&#x6216;&#x8005;&#x6307;&#x5B9A;&#x4E3A;Safari&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x6307;&#x5B9A;HTTP&#x534F;&#x8BAE;&#x7248;&#x672C;&#x4E3A;1.1&#x3001;&#x4F7F;&#x7528;referer&#x7B49;&#x3002;</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="chapter5.html" class="navigation navigation-prev " aria-label="Previous page: 第五章 如何使用Burp Target">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chapter7.html" class="navigation navigation-next " aria-label="Next page: 第七章   如何使用Burp Scanner">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第六章 如何使用Burp Spider","level":"1.7","depth":1,"next":{"title":"第七章   如何使用Burp Scanner","level":"1.8","depth":1,"path":"chapter7.md","ref":"chapter7.md","articles":[]},"previous":{"title":"第五章 如何使用Burp Target","level":"1.6","depth":1,"path":"chapter5.md","ref":"chapter5.md","articles":[]},"dir":"ltr"},"config":{"plugins":["comment"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"comment":{"highlightCommented":true},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"t0data","pdf":{"pageNumbers":true,"fontSize":16,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"burpsuite实战指南","language":"en","links":{"sidebar":{"burpsuite实战指南":"https://www.gitbook.com/book/t0data/burpsuite"},"gitbook":true},"gitbook":"*","description":"burpsuite实战指南，最全面的中文BurpSuite使用教程，自由免费的电子书"},"file":{"path":"chapter6.md","mtime":"2017-11-25T07:12:17.000Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2017-11-25T07:10:59.882Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-comment/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

